In [34]:
import pandas as pd

data = {'Nome': ['Farnei', 'Mário', 'Antar', 'Fernando', 'João', 'Juliano', 'Luciane', 'Márcio', 'Igor', 'Rodger'],
        'Sobrenome': ['Siqueira', 'Oliveira', 'Nasser', 'Oliveira', 'Noethen', 'Zorzan', 'Vieira', 'Mathias', 'Alexandre', 'Colombo'],
        "Idade": [47, 44, 47, 45, 43, 52, 51, 40,38, 32]}
df = pd.DataFrame(data)
df

       Nome  Sobrenome  Idade
0    Farnei   Siqueira     47
1     Mário   Oliveira     44
2     Antar     Nasser     47
3  Fernando   Oliveira     45
4      João    Noethen     43
5   Juliano     Zorzan     52
6   Luciane     Vieira     51
7    Márcio    Mathias     40
8      Igor  Alexandre     38
9    Rodger    Colombo     32

In [17]:
df[['Sobrenome', 'Idade']]

   Sobrenome Idade
0   Siqueira    47
1   Oliveira    44
2     Nasser    47
3   Oliveira    45
4    Noethen    43
5     Zorzan    52
6     Vieira    51
7    Mathias    40
8  Alexandre    38
9    Colombo    32

Excluindo uma coluna

In [18]:
colunas = [col for col in df.columns if not col in ['Sobrenome']]
df[colunas]

       Nome Idade
0    Farnei    47
1     Mário    44
2     Antar    47
3  Fernando    45
4      João    43
5   Juliano    52
6   Luciane    51
7    Márcio    40
8      Igor    38
9    Rodger    32

Filtragem por indexação(.iloc)

In [19]:
df.iloc[1:3]

    Nome Sobrenome Idade
1  Mário  Oliveira    44
2  Antar    Nasser    47

Filtrando por condição

In [20]:
df[df['Nome'] == 'Farnei']

     Nome Sobrenome Idade
0  Farnei  Siqueira    47

In [21]:
df.loc[df['Nome'] == 'Farnei']

     Nome Sobrenome Idade
0  Farnei  Siqueira    47

Filtranso por múltiplas condições

In [36]:
df.loc[(df['Sobrenome'] == 'Oliveira') & (df['Idade'] < 50)]

       Nome Sobrenome  Idade
1     Mário  Oliveira     44
3  Fernando  Oliveira     45

a barra reta abaixo indica 'or'

In [37]:
df.loc[(df['Sobrenome'] == 'Oliveira') | (df['Idade'] > 50)]

       Nome Sobrenome  Idade
1     Mário  Oliveira     44
3  Fernando  Oliveira     45
5   Juliano    Zorzan     52
6   Luciane    Vieira     51

Filtrando por lista de valores (.isin)

In [39]:
nomes = ['Farnei', 'Mário']
df.loc[df['Nome'].isin(nomes)]

     Nome Sobrenome  Idade
0  Farnei  Siqueira     47
1   Mário  Oliveira     44

In [45]:
df.loc[df['Nome'].str.contains('an')]

       Nome Sobrenome  Idade
3  Fernando  Oliveira     45
5   Juliano    Zorzan     52
6   Luciane    Vieira     51